In [1]:
import numpy as np
import pandas as pd

In [71]:
d = {"Name" : ["A","B","C","D"],
    "Roll no" : [1,2,3,4],
    "DOB" : ['12-1-2008','13-11-1996','5-10-2000','1-2-1999'],
    "Brand" : ["Apple","Samsung","Nokia",np.nan],
    "Marks" : ["100","88","91","69"]}

d

{'Name': ['A', 'B', 'C', 'D'],
 'Roll no': [1, 2, 3, 4],
 'DOB': ['12-1-2008', '13-11-1996', '5-10-2000', '1-2-1999'],
 'Brand': ['Apple', 'Samsung', 'Nokia', nan],
 'Marks': ['100', '88', '91', '69']}

In [72]:
data = pd.DataFrame(d)

data

  Name  Roll no         DOB    Brand Marks
0    A        1   12-1-2008    Apple   100
1    B        2  13-11-1996  Samsung    88
2    C        3   5-10-2000    Nokia    91
3    D        4    1-2-1999      NaN    69

In [4]:
type(data)

pandas.core.frame.DataFrame

In [5]:
data.shape

(4, 5)

In [6]:
data.size

20

In [7]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
data['Name']

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [9]:
a = data.Name

a

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [10]:
type(a)

pandas.core.series.Series

In [11]:
data.index = data.Name

In [12]:
data

     Name  Roll no         DOB    Brand Marks
Name
A       A        1   12-1-2008    Apple   100
B       B        2  13-11-1996  Samsung    88
C       C        3   5-10-2000    Nokia    91
D       D        4    1-2-1999      NaN    69

In [13]:
data.drop("Name",axis=1,inplace=True)

In [14]:
data

      Roll no         DOB    Brand Marks
Name
A           1   12-1-2008    Apple   100
B           2  13-11-1996  Samsung    88
C           3   5-10-2000    Nokia    91
D           4    1-2-1999      NaN    69

In [15]:
data.dtypes

Roll no     int64
DOB        object
Brand      object
Marks      object
dtype: object

In [17]:
data.Marks.dtype = int

AttributeError: can't set attribute

In [18]:
data.Marks = data.Marks.astype('int64')

In [19]:
data.dtypes

Roll no     int64
DOB        object
Brand      object
Marks       int64
dtype: object

In [20]:
data

      Roll no         DOB    Brand  Marks
Name
A           1   12-1-2008    Apple    100
B           2  13-11-1996  Samsung     88
C           3   5-10-2000    Nokia     91
D           4    1-2-1999      NaN     69

In [21]:
data = data.rename({'DOB':'Date of Birth'},axis=1)

In [22]:
data

      Roll no Date of Birth    Brand  Marks
Name
A           1     12-1-2008    Apple    100
B           2    13-11-1996  Samsung     88
C           3     5-10-2000    Nokia     91
D           4      1-2-1999      NaN     69

In [23]:
data.isnull().sum()

Roll no          0
Date of Birth    0
Brand            1
Marks            0
dtype: int64

In [24]:
data.isna().sum()

Roll no          0
Date of Birth    0
Brand            1
Marks            0
dtype: int64

In [25]:
data.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [ ]:
data.nunique()

In [26]:
data

      Roll no Date of Birth    Brand  Marks
Name
A           1     12-1-2008    Apple    100
B           2    13-11-1996  Samsung     88
C           3     5-10-2000    Nokia     91
D           4      1-2-1999      NaN     69

In [27]:
data.Name.unique()

AttributeError: 'DataFrame' object has no attribute 'Name'

In [28]:
data.Name.value_counts()

AttributeError: 'DataFrame' object has no attribute 'Name'

In [29]:
data.describe()

        Roll no       Marks
count  4.000000    4.000000
mean   2.500000   87.000000
std    1.290994   13.038405
min    1.000000   69.000000
25%    1.750000   83.250000
50%    2.500000   89.500000
75%    3.250000   93.250000
max    4.000000  100.000000

In [30]:
data.dtypes

Roll no           int64
Date of Birth    object
Brand            object
Marks             int64
dtype: object

In [31]:
data['Date of Birth']

Name
A     12-1-2008
B    13-11-1996
C     5-10-2000
D      1-2-1999
Name: Date of Birth, dtype: object

In [32]:
data = data.rename({"Date of Birth" : "DOB"},axis=1)

In [33]:
data

      Roll no         DOB    Brand  Marks
Name
A           1   12-1-2008    Apple    100
B           2  13-11-1996  Samsung     88
C           3   5-10-2000    Nokia     91
D           4    1-2-1999      NaN     69

In [34]:
data.DOB = data.DOB.astype(int)

ValueError: invalid literal for int() with base 10: '12-1-2008'

In [42]:
data.DOB = pd.to_datetime(data.DOB,format="%d-%m-%y")

ValueError: unconverted data remains: 08

In [ ]:
data

In [ ]:
data.dtypes

In [ ]:
data.DOB.dt.year

In [ ]:
data.DOB.dt.month

In [ ]:
data.DOB.dt.day

In [ ]:
data.DOB.dt.week

In [ ]:
data.DOB.dt.month_name()

In [ ]:
data.DOB.dt.day_name()

In [ ]:
data['Month'] = data.DOB.dt.month_name()

data

In [ ]:
data.dropna(axis=0)

In [ ]:
data

In [ ]:
data = data.fillna("Undefined")

data

In [ ]:
data.isna().sum()

In [ ]:
data.Brand == "Samsung"

In [ ]:
data[data.Brand == "Samsung"]

In [35]:
data[data.Marks<90]

      Roll no         DOB    Brand  Marks
Name
B           2  13-11-1996  Samsung     88
D           4    1-2-1999      NaN     69

In [36]:
data[(data.Month == "November") | (data.Month == "December")]

AttributeError: 'DataFrame' object has no attribute 'Month'

In [37]:
m = ["November","December"]

data[data.Month.isin(m)]

AttributeError: 'DataFrame' object has no attribute 'Month'

In [73]:
data

  Name  Roll no         DOB    Brand Marks
0    A        1   12-1-2008    Apple   100
1    B        2  13-11-1996  Samsung    88
2    C        3   5-10-2000    Nokia    91
3    D        4    1-2-1999      NaN    69

In [74]:
data['Age'] = 2022 - data.DOB.dt.year

data

AttributeError: Can only use .dt accessor with datetimelike values

In [75]:
data['Married'] = 0

data

  Name  Roll no         DOB    Brand Marks  Married
0    A        1   12-1-2008    Apple   100        0
1    B        2  13-11-1996  Samsung    88        0
2    C        3   5-10-2000    Nokia    91        0
3    D        4    1-2-1999      NaN    69        0

In [97]:
data.Married = np.where(data.Age < 20, "Single","Married" )

data

AttributeError: 'DataFrame' object has no attribute 'Age'

In [77]:
data.DOB = pd.to_datetime(data.DOB, dayfirst= True)

data.Marks = data.Marks.astype('int64')

data.dtypes

Name               object
Roll no             int64
DOB        datetime64[ns]
Brand              object
Marks               int64
Married             int64
dtype: object

In [78]:
data

  Name  Roll no        DOB    Brand  Marks  Married
0    A        1 2008-01-12    Apple    100        0
1    B        2 1996-11-13  Samsung     88        0
2    C        3 2000-10-05    Nokia     91        0
3    D        4 1999-02-01      NaN     69        0

In [79]:
data.Brand.fillna('Undefined', inplace=True)

In [80]:
data

  Name  Roll no        DOB      Brand  Marks  Married
0    A        1 2008-01-12      Apple    100        0
1    B        2 1996-11-13    Samsung     88        0
2    C        3 2000-10-05      Nokia     91        0
3    D        4 1999-02-01  Undefined     69        0

In [81]:
data.select_dtypes(int)

   Roll no  Marks  Married
0        1    100        0
1        2     88        0
2        3     91        0
3        4     69        0

In [82]:
data.select_dtypes(exclude = int)

  Name        DOB      Brand
0    A 2008-01-12      Apple
1    B 1996-11-13    Samsung
2    C 2000-10-05      Nokia
3    D 1999-02-01  Undefined

In [83]:
data['month'] = data.DOB.dt.month_name()

data

  Name  Roll no        DOB      Brand  Marks  Married     month
0    A        1 2008-01-12      Apple    100        0   January
1    B        2 1996-11-13    Samsung     88        0  November
2    C        3 2000-10-05      Nokia     91        0   October
3    D        4 1999-02-01  Undefined     69        0  February

In [87]:
data.sort_values(by = 'Marks', ascending = False)

  Name  Roll no        DOB      Brand  Marks  Married     month
0    A        1 2008-01-12      Apple    100        0   January
2    C        3 2000-10-05      Nokia     91        0   October
1    B        2 1996-11-13    Samsung     88        0  November
3    D        4 1999-02-01  Undefined     69        0  February

In [86]:
data.Marks.sort_values()

3     69
1     88
2     91
0    100
Name: Marks, dtype: int64

In [92]:
a = [3,6,2,8,5,7,9,900]

# mean = ?

# median = ?

In [93]:
np.mean(a)

117.5

In [94]:
np.median(a)

6.5

In [95]:
np.mode(a)

AttributeError: module 'numpy' has no attribute 'mode'

In [96]:
data.corr()

          Roll no     Marks  Married
Roll no  1.000000 -0.891133      NaN
Marks   -0.891133  1.000000      NaN
Married       NaN       NaN      NaN

In [98]:
d = {"key" : ['a','b','c','b','a','b'],
    "col1" : [1,2,3,4,5,6],
    "col2" : [9,8,7,6,5,4]}

data = pd.DataFrame(d)

data

  key  col1  col2
0   a     1     9
1   b     2     8
2   c     3     7
3   b     4     6
4   a     5     5
5   b     6     4

In [101]:
dg = data.groupby(by = 'key')

dg

In [102]:
dg.mean()

     col1  col2
key
a     3.0   7.0
b     4.0   6.0
c     3.0   7.0

In [103]:
dg.count()

     col1  col2
key
a       2     2
b       3     3
c       1     1